app/views/users/show.html.erb

  <div class="col-md-8">
   <% if @user.posts.any? %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]