app/controllers/comments_controller.rb

  def create
    @post =   Post.find(params[:post_id])
    @comment = @post.comments.build(params[:content])
    @comment.user = current_user
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Pierwszy komentarz"], ["user_id", 1], ["post_id", 1], ["created_at", 2017-02-04 19:54:46 UTC], ["updated_at", 2017-02-04 19:54:46 UTC]]