app/controllers/posts_controller.rb

  def create
    @user = current_user
    @post = @user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"